# ----------------------------
# Brewfile (modern Mac dev)
# ----------------------------

tap "homebrew/bundle"

# --- Core CLI ---
brew "git"
brew "gh"
brew "wget"
brew "curl"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "htop"
brew "tree"
brew "watch"
brew "direnv"


# --- Shell / productivity ---
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "direnv"

# --- Build toolchain (safe baseline) ---
brew "autoconf"
brew "automake"
brew "libtool"
brew "pkg-config"


# --- Node toolchain (choose one lane) ---
brew "nvm"
brew "corepack"   # prefer over brew yarn; enables yarn/pnpm per-project :contentReference[oaicite:6]{index=6}

# --- Cloud ---
brew "awscli"
# brew "azure-cli"   # uncomment if you use Azure often

# --- Apps ---
cask "visual-studio-code"
cask "cursor"
cask "docker-desktop"   # :contentReference[oaicite:8]{index=8}
cask "postman"          # :contentReference[oaicite:9]{index=9}


# --- Dev toolchain ---
brew "python"      # includes pip
brew "pipx"        # clean Python CLI installs (recommended)

# --- Cloud CLIs ---
brew "awscli"

# --- Containers / local dev ---
cask "docker-desktop"   # Docker Desktop (token changed from "docker") :contentReference[oaicite:3]{index=3}

# --- API dev ---
cask "postman"          :contentReference[oaicite:4]{index=4}
# If you want Postman’s CLI too:
# cask "postman-cli"     :contentReference[oaicite:5]{index=5}

# --- Editors ---
cask "visual-studio-code"
cask "cursor"

# --- Optional: browsers/term ---
# cask "google-chrome"
# cask "iterm2"
