tap "homebrew/bundle"

# --- Core CLI ---
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "watch"

# --- Productivity ---
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "direnv"
brew "htop"
brew "tree"

# --- Build toolchain ---
brew "autoconf"
brew "automake"
brew "libtool"
brew "pkg-config"

# --- Python toolchain ---
brew "python"
brew "pipx"

# --- Node toolchain (nvm lane) ---
brew "nvm"
brew "corepack"

# --- Cloud ---
brew "awscli"

# --- Apps ---
cask "visual-studio-code"
cask "cursor"
cask "docker-desktop"
cask "postman"

# --- Optional (uncomment if needed) ---
# brew "kubernetes-helm"
# brew "eksctl"
# brew "aws-iam-authenticator"
# brew "azure-cli"
# cask "google-chrome"
# cask "iterm2"
