# ----------------------------
# Brewfile (modern Mac dev)
# ----------------------------

tap "homebrew/bundle"

# --- Core CLI ---
brew "git"
brew "gh"
brew "wget"
brew "curl"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "htop"
brew "tree"
brew "watch"
brew "direnv"

# --- Dev toolchain ---
brew "python"      # includes pip
brew "pipx"        # clean Python CLI installs (recommended)
brew "node"        # OPTIONAL: if you prefer brew-managed node instead of nvm
brew "nvm"         # recommended if you want multiple node versions

# --- Cloud CLIs ---
brew "awscli"

# --- Containers / local dev ---
cask "docker-desktop"   # Docker Desktop (token changed from "docker") :contentReference[oaicite:3]{index=3}

# --- API dev ---
cask "postman"          :contentReference[oaicite:4]{index=4}
# If you want Postman’s CLI too:
# cask "postman-cli"     :contentReference[oaicite:5]{index=5}

# --- Editors ---
cask "visual-studio-code"
cask "cursor"

# --- Optional: browsers/term ---
# cask "google-chrome"
# cask "iterm2"
